Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.BarsAffectedEnum Enumeration
 The reinforcing bars affected.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BarsAffectedEnum
Public Enumeration BarsAffectedEnum
Members
Member name | Value | Description
ALL_BARS | 0 |  All reinforcing bars.
EVERY_SECOND_BAR | 1 |  Every second reinforcing bar.
EVERY_THIRD_BAR | 2 |  Every third reinforcing bar.
EVERY_FOURTH_BAR | 3 |  Every fourth reinforcing bar.
See Also
Reference
Tekla.Structures.Model Namespace